modm-ext/data.modm.io/docs/svd/header_stm32f732xx.svd
        <register>
          <name>BTR4</name>
          <description>NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDSET</name>
              <description>ADDSET[3:0] bits (Address setup phase duration)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDHLD</name>
              <description>ADDHLD[3:0] bits (Address-hold phase duration)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATAST</name>
              <description>DATAST [3:0] bits (Data-phase duration)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSTURN</name>
              <description>BUSTURN[3:0] bits (Bus turnaround phase duration)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV[3:0] bits (Clock divide ratio)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DATLAT</name>
              <description>DATLA[3:0] bits (Data latency)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACCMOD</name>
              <description>ACCMOD[1:0] bits (Access mode)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR3</name>
          <description>NAND Flash control register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWAITEN</name>
              <description>Wait feature enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBKEN</name>
              <description>PC Card/NAND Flash memory bank enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTYP</name>
              <description>Memory type</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWID</name>
              <description>PWID[1:0] bits (NAND Flash databus width)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC computation logic enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLR</name>
              <description>TCLR[3:0] bits (CLE to RE delay)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TAR</name>
              <description>TAR[3:0] bits (ALE to RE delay)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ECCPS</name>
              <description>ECCPS[2:0] bits (ECC page size)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR3</name>
          <description>NAND Flash FIFO status and interrupt register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IRS</name>
              <description>Interrupt Rising Edge status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILS</name>
              <description>Interrupt Level status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFS</name>
              <description>Interrupt Falling Edge status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IREN</name>
              <description>Interrupt Rising Edge detection Enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILEN</name>
              <description>Interrupt Level detection Enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFEN</name>
              <description>Interrupt Falling Edge detection Enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEMPT</name>
              <description>FIFO empty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM3</name>
          <description>NAND Flash Common memory space timing register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEMSET3</name>
              <description>MEMSET3[7:0] bits (Common memory 3 setup time)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMWAIT3</name>
              <description>MEMWAIT3[7:0] bits (Common memory 3 wait time)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHOLD3</name>
              <description>MEMHOLD3[7:0] bits (Common memory 3 hold time)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHIZ3</name>
              <description>MEMHIZ3[7:0] bits (Common memory 3 databus HiZ time)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT3</name>
          <description>NAND Flash Attribute memory space timing register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATTSET3</name>
              <description>ATTSET3[7:0] bits (Attribute memory 3 setup time)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTWAIT3</name>
              <description>ATTWAIT3[7:0] bits (Attribute memory 3 wait time)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHOLD3</name>
              <description>ATTHOLD3[7:0] bits (Attribute memory 3 hold time)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHIZ3</name>
              <description>ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR3</name>
          <description>NAND Flash ECC result registers</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECC3</name>
              <description>ECC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
